SecurityEvent
| where TimeGenerated > ago(31d)
| where _IsBillable == true
| summarize GBytes=round(sum(_BilledSize/1024/1024/1024),2) by _IsBillable, Computer
| order by GBytes, Computer
| project Computer, GBytes